gpus-bench/results-L40s-gpu.txt
============ Serving Benchmark Result 256 input length ============
Successful requests:                     10        
Failed requests:                         0         
Maximum request concurrency:             1         
Benchmark duration (s):                  58.31     
Total input tokens:                      2560      
Total generated tokens:                  2560      
Request throughput (req/s):              0.17      
Output token throughput (tok/s):         43.91     
Peak output token throughput (tok/s):    45.00     
Peak concurrent requests:                2.00      
Total token throughput (tok/s):          87.81     
---------------Time to First Token----------------
Mean TTFT (ms):                          56.99     
Median TTFT (ms):                        56.55     
P99 TTFT (ms):                           59.93     
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          22.64     
Median TPOT (ms):                        22.64     
P99 TPOT (ms):                           22.65     
---------------Inter-token Latency----------------
Mean ITL (ms):                           22.64     
Median ITL (ms):                         22.64     
P99 ITL (ms):                            22.97     
==================================================


============ Serving Benchmark Result 1024 input length ============
Successful requests:                     10        
Failed requests:                         0         
Maximum request concurrency:             1         
Benchmark duration (s):                  59.25     
Total input tokens:                      10240     
Total generated tokens:                  2560      
Request throughput (req/s):              0.17      
Output token throughput (tok/s):         43.21     
Peak output token throughput (tok/s):    44.00     
Peak concurrent requests:                2.00      
Total token throughput (tok/s):          216.04    
---------------Time to First Token----------------
Mean TTFT (ms):                          101.33    
Median TTFT (ms):                        101.49    
P99 TTFT (ms):                           105.82    
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          22.83     
Median TPOT (ms):                        22.84     
P99 TPOT (ms):                           22.85     
---------------Inter-token Latency----------------
Mean ITL (ms):                           22.83     
Median ITL (ms):                         22.84     
P99 ITL (ms):                            23.21     
==================================================


============ Serving Benchmark Result 2048 input length ============
Successful requests:                     10        
Failed requests:                         0         
Maximum request concurrency:             1         
Benchmark duration (s):                  60.43     
Total input tokens:                      20480     
Total generated tokens:                  2560      
Request throughput (req/s):              0.17      
Output token throughput (tok/s):         42.36     
Peak output token throughput (tok/s):    44.00     
Peak concurrent requests:                2.00      
Total token throughput (tok/s):          381.25    
---------------Time to First Token----------------
Mean TTFT (ms):                          180.85    
Median TTFT (ms):                        180.54    
P99 TTFT (ms):                           184.57    
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          22.99     
Median TPOT (ms):                        22.99     
P99 TPOT (ms):                           22.99     
---------------Inter-token Latency----------------
Mean ITL (ms):                           22.99     
Median ITL (ms):                         22.99     
P99 ITL (ms):                            23.32     
==================================================